//jobcard JOB
//*
//STEP1    EXEC PGM=GIMSMP,REGION=0M
//SMPCSI   DD DISP=SHR,DSN=<global csi>
//SMPOUT   DD SYSOUT=*
//SMPRPT   DD SYSOUT=*
//SMPLIST  DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SMPCNTL DD *
  SET BDY(GLOBAL) .
  RECEIVE SYSMODS .
  SET BDY(tzone) .
  APPLY S(SDSF001) .
//SMPPTFIN DD *
++USERMOD(SDSF001) REWORK(2021008) .
++VER(Z038) FMID(HQX77C0) PRE(UI64371)
           /* ZOS R24
              PRE() MUST BE CURRENT LEVEL OF ISFUSER
              THIS USERMOD IS AN UPDATE FOR THE SDSF USER EXIT.
              VERIFY SEQUENCE NUNBERS ARE CORRECT BEFORE APPLYING
          */  .
++SRCUPD(ISFUSER) .
./ CHANGE NAME=ISFUSER
* Local Modification
         OI    UPRSFLAG,UPRNORMF   Use DA data from MVS not RMF
* End of Local Modification
